Marian-Wojtkowiak-94/Mobile-Robot/stm32f4/lain_feloer.c
#include "lain_feloer.h"
#include "stm32f4xx_conf.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_adc.h"
#include "stm32f4xx_dma.h"
#include "stm32f4xx_exti.h"

#include "LCD2x16.h"
#include "interface.h"



void lain_feloer_init_ADC_Pin(){
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	GPIO_InitTypeDef  GPIO_InitStructure;
	/* Configure PD12, PD13, PD14 and PD15 in output pushpull mode */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
	//GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	//GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	/* GPIOD Periph clock enable */


}

void lain_feloer_init_ADC(){
	ADC_InitTypeDef       ADC_InitStructure;
	  ADC_CommonInitTypeDef ADC_CommonInitStructure;
	  DMA_InitTypeDef       DMA_InitStructure;

	  /* Enable peripheral clocks *************************************************/
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

	  /* DMA2_Stream0 channel0 configuration **************************************/
	  DMA_DeInit(DMA2_Stream0);
	  DMA_InitStructure.DMA_Channel = DMA_Channel_0;
	  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
	  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)&lain_feloer_ADCConvertedValues[0];
	  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
	  DMA_InitStructure.DMA_BufferSize = 2;
	  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
	  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
	  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	  DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	  DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
	  DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
	  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
	  DMA_Init(DMA2_Stream0, &DMA_InitStructure);
	  /* DMA2_Stream0 enable */
	  DMA_Cmd(DMA2_Stream0, ENABLE);

	  /* ADC Common Init **********************************************************/
	  ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
	  ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
	  ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
	  ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
	  ADC_CommonInit(&ADC_CommonInitStructure);

	  /* ADC1 Init ****************************************************************/
	  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
	  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
	  ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
	  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
	  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
	  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
	  ADC_InitStructure.ADC_NbrOfConversion = 2;
	  ADC_Init(ADC1, &ADC_InitStructure);

	  /* ADC1 regular channel configuration ******************************/
	  ADC_SoftwareStartConv(ADC1);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_8, 1, ADC_SampleTime_480Cycles);
	ADC_RegularChannelConfig(ADC1, ADC_Channel_9, 2, ADC_SampleTime_480Cycles);
	/* Enable DMA request after last transfer (Single-ADC mode) */
	ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);
	/* Enable ADC1 DMA */
	ADC_DMACmd(ADC1, ENABLE);
	/* Enable ADC1 **************************************************************/
	ADC_Cmd(ADC1, ENABLE);
	/* Start ADC1 Software Conversion */
	ADC_SoftwareStartConv(ADC1);
}

int lain_feloer_kierunek(int c1,int c2){
	if((c1<400)&&(c2<400)){
			return 0;
	}
	if(c1<400){
		return -1;
	}
	if(c2<400){
		return 1;
	}
	return -3;
}
void lain_feloer_set(int kierunek){
	static float prosto,prawo;
	if(kierunek==-2){
		//driver_set_rote(0,0);
		prosto=0;
		prawo=0;
	}
	if(kierunek==-3){

	}
	else{
//		driver_set_rote(1,kierunek);
		prosto=1;
		prawo=kierunek;
	}
	driver_set_rote(prosto,prawo);
}
int lain_feloer_state(){
	char zgoda=1;
	while(zgoda){
	while (lain_feloer_ADCConvertedValues[1] == 0xFFFF){

	}
	if (lain_feloer_ADCConvertedValues[1] != 0xFFFF)
	{
		LCD_printl(1,"Lain Feloer  3", lain_feloer_ADCConvertedValues[0], lain_feloer_ADCConvertedValues[1]);
		LCD_printl(2,"%04d %04d", lain_feloer_ADCConvertedValues[0], lain_feloer_ADCConvertedValues[1]);
		lain_feloer_set(lain_feloer_kierunek(lain_feloer_ADCConvertedValues[0], lain_feloer_ADCConvertedValues[1]));
		lain_feloer_ADCConvertedValues[1] = 0xFFFF;
	}
	char przycisk=interface_read_butons_lup();
	if(przycisk==4){
		zgoda=0;
		lain_feloer_set(-2);
	}
	if(przycisk==8){
		lain_feloer_set(1);
	}
	}

	return zgoda;

}
void lain_feloer_init(){
	lain_feloer_init_ADC_Pin();
	lain_feloer_init_ADC();
}
